snail = function (array) {
    let result = [];
    while (array.length) {
        // Возьмем первую строку и удалим ее из массива
        result = result.concat(array.shift());

        // Возьмите последний элемент из каждого оставшегося ряда
        for (let i = 0; i < array.length; i++) { result.push(array[i].pop()); }

        // Возьмите последнюю строку в обратном порядке и удалите ее из массива
        if (array.length) { result = result.concat(array.pop().reverse()); }

        // Возьмите первый элемент из каждого оставшегося ряда в обратном порядке
        for (let i = array.length - 1; i >= 0; i--) { result.push(array[i].shift()); }
    }
    return result;
}

console.log(snail([[1, 2, 3],
[4, 5, 6],
[7, 8, 9]]),
    "[1, 2, 3, 6, 9, 8, 7, 4, 5]");

console.log(snail([[1, 2, 3],
[8, 9, 4],
[7, 6, 5]]),
    "[1, 2, 3, 4, 5, 6, 7, 8, 9]");

console.log(snail([[1, 2, 3, 4, 5],
[6, 7, 8, 9, 10],
[11, 12, 13, 14, 15],
[16, 17, 18, 19, 20],
[21, 22, 23, 24, 25]]),
    "[1, 2, 3, 4, 5, 10, 15, 20, 25, 24, 23, 22, 21, 16, 11, 6, 7, 8, 9, 14, 19, 18, 17, 12, 13]");

console.log(snail([[1, 2, 3, 4, 5, 6],
[20, 21, 22, 23, 24, 7],
[19, 32, 33, 34, 25, 8], [18, 31, 36, 35, 26, 9],
[17, 30, 29, 28, 27, 10],
[16, 15, 14, 13, 12, 11]]),
    "[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36]");