export let names: string[] = [
    "Верронн",
    "Верллианн",
    "Вильгельм",
    "Вениамин",
    "Вандон",
    "Виктуар",
    "Аэлмар",
    "Алексий",
    "Аэлнесс",
    "Абархам",
    "Афкиллар",
    "Анвиль",
    "Арравел ",
    "Арнольд",
    "Агмасс ",
    "Арчибальд",
    "Андерс",
    "Арни",
    "Алекс",
    "Арчи",
    "Антеон",
    "Альбус",
    "Айбер",
    "Адам",
    "Бесталл",
    "Боркас",
    "Баэлнесс",
    "Брэндон",
    "Боб",
    "Брандон",
    "Беон",
    "Бобби",
    "Бурбон",
    "Берадот",
]

export enum Classes {
    KNIGHT = "KNIGHT",
    ASSASIN = "ASSASIN",
    ARCHER = "ARCHER"
}

export const fireDamage:number = 10;